Repository: grcjariten/tdeecalculator
Catalog: lib/l10n/app_*.arb
Languages: es, fr, it

# appTitle
source: TDEE Calculator
es: Calculadora TDEE
fr: Calculateur TDEE
it: Calcolatore TDEE

# appSubtitle
source: Find your maintenance calories and daily target.
es: Calcula tus calorías de mantenimiento y el objetivo diario.
fr: Calculez vos calories de maintien et votre objectif quotidien.
it: Calcola le calorie di mantenimento e il target giornaliero.

# unitsLabel
source: Units
es: Unidades
fr: Unités
it: Unità

source: Metric
es: Métrico
fr: Métrique
it: Metrico

source: Imperial
fr: Impérial
it: Imperiale

source: Basics
es: Datos básicos
fr: Bases
it: Dati base

source: Gender
es: Sexo
fr: Sexe
it: Sesso

source: Male
es: Hombre
fr: Homme
it: Uomo

source: Female
es: Mujer
fr: Femme
it: Donna

source: Age
es: Edad
fr: Âge
it: Età

source: years
es: años
fr: ans
it: anni

source: Weight
es: Peso
fr: Poids
it: Peso

source: Height
es: Altura
fr: Taille
it: Altezza

# activitySection
source: Activity
es: Actividad
fr: Activité
it: Attività

source: Activity level
es: Nivel de actividad
fr: Niveau d'activité
it: Livello di attività

# activitySedentary
source: Sedentary
es: Sedentario
fr: Sédentaire
it: Sedentario

# activityLight
source: Light activity
es: Actividad ligera
fr: Activité légère
it: Attività leggera

# activityModerate
source: Moderate activity
es: Actividad moderada
fr: Activité modérée
it: Attività moderata

# activityHigh
source: High activity
es: Actividad alta
fr: Activité intense
it: Attività intensa

# activityElite
source: Elite athlete
es: Atleta avanzado
fr: Athlète avancé
it: Atleta evoluto

source: Body fat (optional)
es: Grasa corporal (opcional)
fr: Masse grasse (optionnel)
it: Massa grassa (opzionale)

source: Body fat (required)
es: Grasa corporal (obligatoria)
fr: Masse grasse (obligatoire)
it: Massa grassa (obbligatoria)

# formulaSection
source: Formula
es: Fórmula
fr: Formule

# formulaLabel
source: BMR formula
es: Fórmula BMR
fr: Formule BMR
it: Formula BMR

# formulaHarris
source: Harris-Benedict (original)
fr: Harris-Benedict (originale)
it: Harris-Benedict (originale)

# goalSection
source: Goal
es: Objetivo
fr: Objectif
it: Obiettivo

source: Goal
es: Objetivo
fr: Objectif
it: Obiettivo

# goalMaintain
source: Maintain weight
es: Mantener
fr: Maintenir
it: Mantenimento

# goalLose
source: Lose weight
es: Bajar
fr: Perdre
it: Dimagrire

# goalGain
source: Gain weight
es: Ganar
fr: Gagner
it: Aumentare

source: Calculate
es: Calcular
fr: Calculer
it: Calcola

# validationRequired
source: Required
es: Obligatorio
fr: Obligatoire
it: Obbligatorio

# validationInvalidNumber
source: Invalid number
es: Número no válido
fr: Nombre invalide
it: Numero non valido

# validationOutOfRange
source: Out of range
es: Fuera de rango
fr: Hors limites
it: Fuori intervallo

# validationBodyFatRequired
source: Body fat required for Katch-McArdle.
es: Grasa corporal obligatoria para Katch-McArdle.
fr: Masse grasse obligatoire pour Katch-McArdle.
it: Massa grassa obbligatoria per Katch-McArdle.

# resultsTitle
source: Your results
es: Tus resultados
fr: Vos résultats
it: I tuoi risultati

source: Daily target
es: Objetivo diario
fr: Objectif quotidien
it: Target giornaliero

source: calories per day
es: calorías por día
fr: calories par jour
it: calorie al giorno

source: Weekly target
es: Objetivo semanal
fr: Objectif hebdomadaire
it: Target settimanale

source: calories per week
es: calorías por semana
fr: calories par semaine
it: calorie a settimana

source: Breakdown
es: Detalle
fr: Détail
it: Dettagli

source: Formula used
es: Fórmula usada
fr: Formule utilisée
it: Formula usata

source: Target calories
es: Calorías objetivo
fr: Calories cible
it: Calorie target

source: Maintenance
es: Mantenimiento
fr: Maintien
it: Mantenimento

source: New BMI
es: Nuevo BMI
fr: Nouveau BMI
it: Nuovo BMI

source: BMI alternatives
es: Alternativas BMI
fr: Alternatives BMI
it: Alternative BMI

source: Ideal weight
es: Peso ideal
fr: Poids idéal
it: Peso ideale

source: per day
es: por día
fr: par jour
it: al giorno

source: Compare formulas
es: Comparar fórmulas
fr: Comparer les formules
it: Confronta formule

source: Requires body fat
es: Requiere grasa corporal
fr: Nécessite la masse grasse
it: Richiede la massa grassa

# copyResults
source: Copy
es: Copiar
fr: Copier
it: Copia

# shareResults
source: Share
es: Compartir
fr: Partager
it: Condividi

source: Results copied
es: Resultados copiados
fr: Résultats copiés
it: Risultati copiati

# aboutTitle
source: About
es: Acerca de
fr: À propos
it: Info

source: Formulas used
es: Fórmulas usadas
fr: Formules utilisées
it: Formule utilizzate

# tdeeUsesHB
source: - TDEE uses the formula you select (Harris-Benedict, Mifflin-St Jeor, or Katch-McArdle).
es: - El TDEE usa la fórmula seleccionada (Harris-Benedict, Mifflin-St Jeor o Katch-McArdle).
fr: - Le TDEE utilise la formule choisie (Harris-Benedict, Mifflin-St Jeor ou Katch-McArdle).
it: - Il TDEE usa la formula selezionata (Harris-Benedict, Mifflin-St Jeor o Katch-McArdle).

# menMetric
source: Men (Harris-Benedict)
es: Hombres (Harris-Benedict)
fr: Hommes (Harris-Benedict)
it: Uomini (Harris-Benedict)

# menMetricFormula
source: BMR = 66.5 + (13.76 x weight kg) + (5.003 x height cm) - (6.755 x age)
es: BMR = 66.5 + (13.76 x peso kg) + (5.003 x altura cm) - (6.755 x edad)
fr: BMR = 66.5 + (13.76 x poids kg) + (5.003 x taille cm) - (6.755 x âge)
it: BMR = 66.5 + (13.76 x peso kg) + (5.003 x altezza cm) - (6.755 x età)

# womenMetric
source: Women (Harris-Benedict)
es: Mujeres (Harris-Benedict)
fr: Femmes (Harris-Benedict)
it: Donne (Harris-Benedict)

# womenMetricFormula
source: BMR = 655 + (9.563 x weight kg) + (1.850 x height cm) - (4.676 x age)
es: BMR = 655 + (9.563 x peso kg) + (1.850 x altura cm) - (4.676 x edad)
fr: BMR = 655 + (9.563 x poids kg) + (1.850 x taille cm) - (4.676 x âge)
it: BMR = 655 + (9.563 x peso kg) + (1.850 x altezza cm) - (4.676 x età)

# mifflinMenFormula
source: Men: BMR = (10 x weight kg) + (6.25 x height cm) - (5 x age) + 5
es: Hombres: BMR = (10 x peso kg) + (6.25 x altura cm) - (5 x edad) + 5
fr: Hommes : BMR = (10 x poids kg) + (6.25 x taille cm) - (5 x âge) + 5
it: Uomini: BMR = (10 x peso kg) + (6.25 x altezza cm) - (5 x età) + 5

# mifflinWomenFormula
source: Women: BMR = (10 x weight kg) + (6.25 x height cm) - (5 x age) - 161
es: Mujeres: BMR = (10 x peso kg) + (6.25 x altura cm) - (5 x edad) - 161
fr: Femmes : BMR = (10 x poids kg) + (6.25 x taille cm) - (5 x âge) - 161
it: Donne: BMR = (10 x peso kg) + (6.25 x altezza cm) - (5 x età) - 161

# bodyFatNote
source: Katch-McArdle (requires body fat):
es: Katch-McArdle (requiere grasa corporal):
fr: Katch-McArdle (nécessite la masse grasse) :
it: Katch-McArdle (richiede massa grassa):

# bmiFormulasTitle
source: BMI formulas
es: Fórmulas BMI
fr: Formules BMI
it: Formule BMI

# bmiFormula
source: BMI = weight kg / height m^2
es: BMI = peso kg / altura m^2
fr: BMI = poids kg / taille m^2
it: BMI = peso kg / altezza m^2

# newBmiFormula
source: New BMI = 1.3 x weight kg / height m^2.5
es: Nuevo BMI = 1.3 x peso kg / altura m^2.5
fr: Nouveau BMI = 1.3 x poids kg / taille m^2.5
it: Nuovo BMI = 1.3 x peso kg / altezza m^2.5

# idealWeightNote
source: - Ideal weight uses the Lorenz formula:
es: - El peso ideal usa la fórmula de Lorenz:
fr: - Le poids idéal utilise la formule de Lorenz :
it: - Il peso ideale usa la formula di Lorenz:

# lorenzMen
source: Men: height cm - 100 - (height cm - 150) / 4
es: Hombres: altura cm - 100 - (altura cm - 150) / 4
fr: Hommes : taille cm - 100 - (taille cm - 150) / 4
it: Uomini: altezza cm - 100 - (altezza cm - 150) / 4

# lorenzWomen
source: Women: height cm - 100 - (height cm - 150) / 2
es: Mujeres: altura cm - 100 - (altura cm - 150) / 2
fr: Femmes : taille cm - 100 - (taille cm - 150) / 2
it: Donne: altezza cm - 100 - (altezza cm - 150) / 2

# dataSafetyTitle
source: Data safety
es: Seguridad de los datos
fr: Sécurité des données
it: Sicurezza dei dati

# dataSafetyNoData
source: The app itself does not collect personal data. Ads are served by Google AdMob, which may collect device identifiers and diagnostics. See the privacy policy for details.
es: La app no recopila datos personales. Los anuncios se sirven mediante Google AdMob, que puede recopilar identificadores del dispositivo y datos de diagnóstico. Consulta la política de privacidad.
fr: L'application ne collecte pas de données personnelles. Les annonces sont diffusées par Google AdMob, qui peut collecter des identifiants de l'appareil et des données de diagnostic. Voir la politique de confidentialité.
it: L'app non raccoglie dati personali. Gli annunci sono forniti da Google AdMob, che può raccogliere identificativi del dispositivo e dati diagnostici. Vedi la privacy policy.

# privacyPolicyTitle
source: Privacy policy
es: Política de privacidad
fr: Politique de confidentialité

# privacyPolicyLinkLabel
source: Privacy policy link
es: Enlace a la política
fr: Lien vers la politique
it: Link privacy policy

# privacyPolicyCopy
source: Copy link
es: Copiar enlace
fr: Copier le lien
it: Copia link

# privacyPolicyCopied
source: Link copied
es: Enlace copiado
fr: Lien copié
it: Link copiato

# iconCredit
source: Icon assets designed with resources from Flaticon.com.
es: Iconos creados con recursos de Flaticon.com.
fr: Icônes créées avec des ressources de Flaticon.com.
it: Icone create con risorse di Flaticon.com.

source: calories
es: calorías
it: calorie
